#1. จงสร้างฟังก์ชัน f(x) =  ⌊ x/5 ⌋  โดยจะส่งผลลัพธ์กลับไป เมื่อ x คือจำนวนเต็มที่รับมาจากแป้นพิมพ์
import math
x = int(input("Pls input number in x"))
w = float(input("Pls input float in w"))
def f(x):
  return math.floor(x/5)

#1.1 จงสร้างฟังก์ชัน g(x) = 4x 2 -90 โดยจะส่งผลลัพธ์กลับไป เมื่อ x คือค่าที่รับมาจากแป้นพิมพ์
def g(x):
  return ((4*(x**2))-90)

#1.2 รับค่าจำนวนเต็ม x 1 ค่าจากผู้ใช้ผ่านหน้าจอ และรับค่า w เป็นจำนวนทศนิยมยาว 5 หลัก 1 ค่าจากผู้ใช้ผ่านหน้าจอ 
#และแสดงค่า x และค่าผลลัพธ์การปัดเศษเลขทศนิยมของเลข w ที่รับเข้ามา ให้เป็นเลขทศนิยม 2 หลัก ออกทางหน้าจอ
print(x)
print(round(w,2))

#1.3  แสดงค่าของ f(x) ออกทางหน้าจอ
print("f(x) = ",f(x))

#1.4แสดงค่าของ g(f(x)) และ f(g(x)) ออกทางหน้าจอ
print("g(f(x)) = ",g(f(x)))
print("f(g(x)) = ",f(g(x)))

#1.5หาค่าของ g 3 (x) แสดงผลออกทางหน้าจอ
print("g**3(x) = ",g(g(g(x))))